-- usersテーブルにサンプルデータを挿入
INSERT INTO `users` (name, password, mail) VALUES
  ('user1', 'pass1', 'example1@example.com'),
  ('user2', 'pass2', 'example2@example.com'),
  ('user3', 'pass3', 'example3@example.com'),
  ('user4', 'pass4', 'example4@example.com'),
  ('user5', 'pass5', 'example5@example.com')
  ;
-- past_scoresテーブルにサンプルデータを挿入
INSERT INTO `past_scores` (`score`, `date`, `check_index`, `user_id`) VALUES
-- user1 のデータ
(20, '2024/12/01 09:15', '[1,2,3,6,9]', 1),
(58, '2024/12/03 11:30', '[1,2,3,6,7,9,11,23,24,25]', 1),
-- user2 のデータ
(24, '2024/12/02 14:00', '[1,2,3,6,9,10]', 2),
(48, '2024/12/05 13:45', '[1,2,3,6,7,9,11,23,24]', 2),
-- user3 のデータ
(20, '2024/12/04 10:20', '[1,2,3,6,9]', 3),
(58, '2024/12/06 16:00', '[1,2,3,6,7,9,11,23,24,25]', 3),
-- user4 のデータ
(24, '2024/12/07 09:30', '[1,2,3,6,9,10]', 4),
(48, '2024/12/08 18:00', '[1,2,3,6,7,9,11,23,24]', 4),
-- user5 のデータ
(20, '2024/12/09 08:45', '[1,2,3,6,9]', 5),
(58, '2024/12/10 19:20', '[1,2,3,6,7,9,11,23,24,25]', 5)
;